benchmarks/multiworker_rerun_nosave_raw_output.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: k6_query_load.js
        output: json (/tmp/mw_timeseries_nosave.json)

     scenarios: (100.00%) 1 scenario, 50 max VUs, 3m30s max duration (incl. graceful stop):
              * query_mix: 50 looping VUs for 3m0s (gracefulStop: 30s)


Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

Run         [ 100% ] setup()
query_mix   [   0% ]

running (0m16.0s), 50/50 VUs, 0 complete and 0 interrupted iterations
query_mix   [   0% ] 50 VUs  0m00.1s/3m0s

running (0m17.0s), 50/50 VUs, 119 complete and 0 interrupted iterations
query_mix   [   1% ] 50 VUs  0m01.1s/3m0s

running (0m18.0s), 50/50 VUs, 323 complete and 0 interrupted iterations
query_mix   [   1% ] 50 VUs  0m02.1s/3m0s

running (0m19.0s), 50/50 VUs, 560 complete and 0 interrupted iterations
query_mix   [   2% ] 50 VUs  0m03.1s/3m0s

running (0m20.0s), 50/50 VUs, 797 complete and 0 interrupted iterations
query_mix   [   2% ] 50 VUs  0m04.1s/3m0s

running (0m21.0s), 50/50 VUs, 1040 complete and 0 interrupted iterations
query_mix   [   3% ] 50 VUs  0m05.1s/3m0s

running (0m22.0s), 50/50 VUs, 1278 complete and 0 interrupted iterations
query_mix   [   3% ] 50 VUs  0m06.1s/3m0s

running (0m23.0s), 50/50 VUs, 1516 complete and 0 interrupted iterations
query_mix   [   4% ] 50 VUs  0m07.1s/3m0s

running (0m24.0s), 50/50 VUs, 1760 complete and 0 interrupted iterations
query_mix   [   4% ] 50 VUs  0m08.1s/3m0s

running (0m25.0s), 50/50 VUs, 2002 complete and 0 interrupted iterations
query_mix   [   5% ] 50 VUs  0m09.1s/3m0s

running (0m26.0s), 50/50 VUs, 2242 complete and 0 interrupted iterations
query_mix   [   6% ] 50 VUs  0m10.1s/3m0s

running (0m27.0s), 50/50 VUs, 2480 complete and 0 interrupted iterations
query_mix   [   6% ] 50 VUs  0m11.1s/3m0s

running (0m28.0s), 50/50 VUs, 2713 complete and 0 interrupted iterations
query_mix   [   7% ] 50 VUs  0m12.1s/3m0s

running (0m29.0s), 50/50 VUs, 2953 complete and 0 interrupted iterations
query_mix   [   7% ] 50 VUs  0m13.1s/3m0s

running (0m30.0s), 50/50 VUs, 3197 complete and 0 interrupted iterations
query_mix   [   8% ] 50 VUs  0m14.1s/3m0s

running (0m31.0s), 50/50 VUs, 3435 complete and 0 interrupted iterations
query_mix   [   8% ] 50 VUs  0m15.1s/3m0s

running (0m32.0s), 50/50 VUs, 3676 complete and 0 interrupted iterations
query_mix   [   9% ] 50 VUs  0m16.1s/3m0s

running (0m33.0s), 50/50 VUs, 3917 complete and 0 interrupted iterations
query_mix   [   9% ] 50 VUs  0m17.1s/3m0s

running (0m34.0s), 50/50 VUs, 4159 complete and 0 interrupted iterations
query_mix   [  10% ] 50 VUs  0m18.1s/3m0s

running (0m35.0s), 50/50 VUs, 4402 complete and 0 interrupted iterations
query_mix   [  11% ] 50 VUs  0m19.1s/3m0s

running (0m36.0s), 50/50 VUs, 4637 complete and 0 interrupted iterations
query_mix   [  11% ] 50 VUs  0m20.1s/3m0s

running (0m37.0s), 50/50 VUs, 4876 complete and 0 interrupted iterations
query_mix   [  12% ] 50 VUs  0m21.1s/3m0s

running (0m38.0s), 50/50 VUs, 5120 complete and 0 interrupted iterations
query_mix   [  12% ] 50 VUs  0m22.1s/3m0s

running (0m39.0s), 50/50 VUs, 5362 complete and 0 interrupted iterations
query_mix   [  13% ] 50 VUs  0m23.1s/3m0s

running (0m40.0s), 50/50 VUs, 5600 complete and 0 interrupted iterations
query_mix   [  13% ] 50 VUs  0m24.1s/3m0s

running (0m41.0s), 50/50 VUs, 5837 complete and 0 interrupted iterations
query_mix   [  14% ] 50 VUs  0m25.1s/3m0s

running (0m42.0s), 50/50 VUs, 6066 complete and 0 interrupted iterations
query_mix   [  14% ] 50 VUs  0m26.1s/3m0s

running (0m43.0s), 50/50 VUs, 6314 complete and 0 interrupted iterations
query_mix   [  15% ] 50 VUs  0m27.1s/3m0s

running (0m44.0s), 50/50 VUs, 6548 complete and 0 interrupted iterations
query_mix   [  16% ] 50 VUs  0m28.1s/3m0s

running (0m45.0s), 50/50 VUs, 6787 complete and 0 interrupted iterations
query_mix   [  16% ] 50 VUs  0m29.1s/3m0s

running (0m46.0s), 50/50 VUs, 7025 complete and 0 interrupted iterations
query_mix   [  17% ] 50 VUs  0m30.1s/3m0s

running (0m47.0s), 50/50 VUs, 7261 complete and 0 interrupted iterations
query_mix   [  17% ] 50 VUs  0m31.1s/3m0s

running (0m48.0s), 50/50 VUs, 7509 complete and 0 interrupted iterations
query_mix   [  18% ] 50 VUs  0m32.1s/3m0s

running (0m49.0s), 50/50 VUs, 7752 complete and 0 interrupted iterations
query_mix   [  18% ] 50 VUs  0m33.1s/3m0s

running (0m50.0s), 50/50 VUs, 7989 complete and 0 interrupted iterations
query_mix   [  19% ] 50 VUs  0m34.1s/3m0s

running (0m51.0s), 50/50 VUs, 8225 complete and 0 interrupted iterations
query_mix   [  19% ] 50 VUs  0m35.1s/3m0s

running (0m52.0s), 50/50 VUs, 8464 complete and 0 interrupted iterations
query_mix   [  20% ] 50 VUs  0m36.1s/3m0s

running (0m53.0s), 50/50 VUs, 8709 complete and 0 interrupted iterations
query_mix   [  21% ] 50 VUs  0m37.1s/3m0s

running (0m54.0s), 50/50 VUs, 8948 complete and 0 interrupted iterations
query_mix   [  21% ] 50 VUs  0m38.1s/3m0s

running (0m55.0s), 50/50 VUs, 9189 complete and 0 interrupted iterations
query_mix   [  22% ] 50 VUs  0m39.1s/3m0s

running (0m56.0s), 50/50 VUs, 9430 complete and 0 interrupted iterations
query_mix   [  22% ] 50 VUs  0m40.1s/3m0s

running (0m57.0s), 50/50 VUs, 9666 complete and 0 interrupted iterations
query_mix   [  23% ] 50 VUs  0m41.1s/3m0s

running (0m58.0s), 50/50 VUs, 9906 complete and 0 interrupted iterations
query_mix   [  23% ] 50 VUs  0m42.1s/3m0s

running (0m59.0s), 50/50 VUs, 10152 complete and 0 interrupted iterations
query_mix   [  24% ] 50 VUs  0m43.1s/3m0s

running (1m00.0s), 50/50 VUs, 10393 complete and 0 interrupted iterations
query_mix   [  24% ] 50 VUs  0m44.1s/3m0s

running (1m01.0s), 50/50 VUs, 10628 complete and 0 interrupted iterations
query_mix   [  25% ] 50 VUs  0m45.1s/3m0s

running (1m02.0s), 50/50 VUs, 10867 complete and 0 interrupted iterations
query_mix   [  26% ] 50 VUs  0m46.1s/3m0s

running (1m03.0s), 50/50 VUs, 11107 complete and 0 interrupted iterations
query_mix   [  26% ] 50 VUs  0m47.1s/3m0s

running (1m04.0s), 50/50 VUs, 11344 complete and 0 interrupted iterations
query_mix   [  27% ] 50 VUs  0m48.1s/3m0s

running (1m05.0s), 50/50 VUs, 11583 complete and 0 interrupted iterations
query_mix   [  27% ] 50 VUs  0m49.1s/3m0s

running (1m06.0s), 50/50 VUs, 11815 complete and 0 interrupted iterations
query_mix   [  28% ] 50 VUs  0m50.1s/3m0s

running (1m07.0s), 50/50 VUs, 12057 complete and 0 interrupted iterations
query_mix   [  28% ] 50 VUs  0m51.1s/3m0s

running (1m08.0s), 50/50 VUs, 12299 complete and 0 interrupted iterations
query_mix   [  29% ] 50 VUs  0m52.1s/3m0s

running (1m09.0s), 50/50 VUs, 12535 complete and 0 interrupted iterations
query_mix   [  29% ] 50 VUs  0m53.1s/3m0s

running (1m10.0s), 50/50 VUs, 12770 complete and 0 interrupted iterations
query_mix   [  30% ] 50 VUs  0m54.1s/3m0s

running (1m11.0s), 50/50 VUs, 13011 complete and 0 interrupted iterations
query_mix   [  31% ] 50 VUs  0m55.1s/3m0s

running (1m12.0s), 50/50 VUs, 13255 complete and 0 interrupted iterations
query_mix   [  31% ] 50 VUs  0m56.1s/3m0s

running (1m13.0s), 50/50 VUs, 13488 complete and 0 interrupted iterations
query_mix   [  32% ] 50 VUs  0m57.1s/3m0s

running (1m14.0s), 50/50 VUs, 13730 complete and 0 interrupted iterations
query_mix   [  32% ] 50 VUs  0m58.1s/3m0s

running (1m15.0s), 50/50 VUs, 13966 complete and 0 interrupted iterations
query_mix   [  33% ] 50 VUs  0m59.1s/3m0s

running (1m16.0s), 50/50 VUs, 14207 complete and 0 interrupted iterations
query_mix   [  33% ] 50 VUs  1m00.1s/3m0s

running (1m17.0s), 50/50 VUs, 14450 complete and 0 interrupted iterations
query_mix   [  34% ] 50 VUs  1m01.1s/3m0s

running (1m18.0s), 50/50 VUs, 14683 complete and 0 interrupted iterations
query_mix   [  34% ] 50 VUs  1m02.1s/3m0s

running (1m19.0s), 50/50 VUs, 14927 complete and 0 interrupted iterations
query_mix   [  35% ] 50 VUs  1m03.1s/3m0s

running (1m20.0s), 50/50 VUs, 15167 complete and 0 interrupted iterations
query_mix   [  36% ] 50 VUs  1m04.1s/3m0s

running (1m21.0s), 50/50 VUs, 15403 complete and 0 interrupted iterations
query_mix   [  36% ] 50 VUs  1m05.1s/3m0s

running (1m22.0s), 50/50 VUs, 15648 complete and 0 interrupted iterations
query_mix   [  37% ] 50 VUs  1m06.1s/3m0s

running (1m23.0s), 50/50 VUs, 15887 complete and 0 interrupted iterations
query_mix   [  37% ] 50 VUs  1m07.1s/3m0s

running (1m24.0s), 50/50 VUs, 16126 complete and 0 interrupted iterations
query_mix   [  38% ] 50 VUs  1m08.1s/3m0s

running (1m25.0s), 50/50 VUs, 16363 complete and 0 interrupted iterations
query_mix   [  38% ] 50 VUs  1m09.1s/3m0s

running (1m26.0s), 50/50 VUs, 16597 complete and 0 interrupted iterations
query_mix   [  39% ] 50 VUs  1m10.1s/3m0s

running (1m27.0s), 50/50 VUs, 16838 complete and 0 interrupted iterations
query_mix   [  39% ] 50 VUs  1m11.1s/3m0s

running (1m28.0s), 50/50 VUs, 17081 complete and 0 interrupted iterations
query_mix   [  40% ] 50 VUs  1m12.1s/3m0s

running (1m29.0s), 50/50 VUs, 17321 complete and 0 interrupted iterations
query_mix   [  41% ] 50 VUs  1m13.1s/3m0s

running (1m30.0s), 50/50 VUs, 17564 complete and 0 interrupted iterations
query_mix   [  41% ] 50 VUs  1m14.1s/3m0s

running (1m31.0s), 50/50 VUs, 17802 complete and 0 interrupted iterations
query_mix   [  42% ] 50 VUs  1m15.1s/3m0s

running (1m32.0s), 50/50 VUs, 18043 complete and 0 interrupted iterations
query_mix   [  42% ] 50 VUs  1m16.1s/3m0s

running (1m33.0s), 50/50 VUs, 18289 complete and 0 interrupted iterations
query_mix   [  43% ] 50 VUs  1m17.1s/3m0s

running (1m34.0s), 50/50 VUs, 18527 complete and 0 interrupted iterations
query_mix   [  43% ] 50 VUs  1m18.1s/3m0s

running (1m35.0s), 50/50 VUs, 18766 complete and 0 interrupted iterations
query_mix   [  44% ] 50 VUs  1m19.1s/3m0s

running (1m36.0s), 50/50 VUs, 19004 complete and 0 interrupted iterations
query_mix   [  44% ] 50 VUs  1m20.1s/3m0s

running (1m37.0s), 50/50 VUs, 19247 complete and 0 interrupted iterations
query_mix   [  45% ] 50 VUs  1m21.1s/3m0s

running (1m38.0s), 50/50 VUs, 19489 complete and 0 interrupted iterations
query_mix   [  46% ] 50 VUs  1m22.1s/3m0s

running (1m39.0s), 50/50 VUs, 19732 complete and 0 interrupted iterations
query_mix   [  46% ] 50 VUs  1m23.1s/3m0s

running (1m40.0s), 50/50 VUs, 19965 complete and 0 interrupted iterations
query_mix   [  47% ] 50 VUs  1m24.1s/3m0s

running (1m41.0s), 50/50 VUs, 20202 complete and 0 interrupted iterations
query_mix   [  47% ] 50 VUs  1m25.1s/3m0s

running (1m42.0s), 50/50 VUs, 20447 complete and 0 interrupted iterations
query_mix   [  48% ] 50 VUs  1m26.1s/3m0s

running (1m43.0s), 50/50 VUs, 20688 complete and 0 interrupted iterations
query_mix   [  48% ] 50 VUs  1m27.1s/3m0s

running (1m44.0s), 50/50 VUs, 20928 complete and 0 interrupted iterations
query_mix   [  49% ] 50 VUs  1m28.1s/3m0s

running (1m45.0s), 50/50 VUs, 21169 complete and 0 interrupted iterations
query_mix   [  49% ] 50 VUs  1m29.1s/3m0s

running (1m46.0s), 50/50 VUs, 21404 complete and 0 interrupted iterations
query_mix   [  50% ] 50 VUs  1m30.1s/3m0s

running (1m47.0s), 50/50 VUs, 21648 complete and 0 interrupted iterations
query_mix   [  51% ] 50 VUs  1m31.1s/3m0s

running (1m48.0s), 50/50 VUs, 21891 complete and 0 interrupted iterations
query_mix   [  51% ] 50 VUs  1m32.1s/3m0s

running (1m49.0s), 50/50 VUs, 22127 complete and 0 interrupted iterations
query_mix   [  52% ] 50 VUs  1m33.1s/3m0s

running (1m50.0s), 50/50 VUs, 22367 complete and 0 interrupted iterations
query_mix   [  52% ] 50 VUs  1m34.1s/3m0s

running (1m51.0s), 50/50 VUs, 22603 complete and 0 interrupted iterations
query_mix   [  53% ] 50 VUs  1m35.1s/3m0s

running (1m52.0s), 50/50 VUs, 22847 complete and 0 interrupted iterations
query_mix   [  53% ] 50 VUs  1m36.1s/3m0s

running (1m53.0s), 50/50 VUs, 23094 complete and 0 interrupted iterations
query_mix   [  54% ] 50 VUs  1m37.1s/3m0s

running (1m54.0s), 50/50 VUs, 23333 complete and 0 interrupted iterations
query_mix   [  54% ] 50 VUs  1m38.1s/3m0s

running (1m55.0s), 50/50 VUs, 23574 complete and 0 interrupted iterations
query_mix   [  55% ] 50 VUs  1m39.1s/3m0s

running (1m56.0s), 50/50 VUs, 23811 complete and 0 interrupted iterations
query_mix   [  56% ] 50 VUs  1m40.1s/3m0s

running (1m57.0s), 50/50 VUs, 24051 complete and 0 interrupted iterations
query_mix   [  56% ] 50 VUs  1m41.1s/3m0s

running (1m58.0s), 50/50 VUs, 24296 complete and 0 interrupted iterations
query_mix   [  57% ] 50 VUs  1m42.1s/3m0s

running (1m59.0s), 50/50 VUs, 24535 complete and 0 interrupted iterations
query_mix   [  57% ] 50 VUs  1m43.1s/3m0s

running (2m00.0s), 50/50 VUs, 24768 complete and 0 interrupted iterations
query_mix   [  58% ] 50 VUs  1m44.1s/3m0s

running (2m01.0s), 50/50 VUs, 25010 complete and 0 interrupted iterations
query_mix   [  58% ] 50 VUs  1m45.1s/3m0s

running (2m02.0s), 50/50 VUs, 25250 complete and 0 interrupted iterations
query_mix   [  59% ] 50 VUs  1m46.1s/3m0s

running (2m03.0s), 50/50 VUs, 25490 complete and 0 interrupted iterations
query_mix   [  59% ] 50 VUs  1m47.1s/3m0s

running (2m04.0s), 50/50 VUs, 25735 complete and 0 interrupted iterations
query_mix   [  60% ] 50 VUs  1m48.1s/3m0s

running (2m05.0s), 50/50 VUs, 25975 complete and 0 interrupted iterations
query_mix   [  61% ] 50 VUs  1m49.1s/3m0s

running (2m06.0s), 50/50 VUs, 26213 complete and 0 interrupted iterations
query_mix   [  61% ] 50 VUs  1m50.1s/3m0s

running (2m07.0s), 50/50 VUs, 26451 complete and 0 interrupted iterations
query_mix   [  62% ] 50 VUs  1m51.1s/3m0s

running (2m08.0s), 50/50 VUs, 26694 complete and 0 interrupted iterations
query_mix   [  62% ] 50 VUs  1m52.1s/3m0s

running (2m09.0s), 50/50 VUs, 26930 complete and 0 interrupted iterations
query_mix   [  63% ] 50 VUs  1m53.1s/3m0s

running (2m10.0s), 50/50 VUs, 27174 complete and 0 interrupted iterations
query_mix   [  63% ] 50 VUs  1m54.1s/3m0s

running (2m11.0s), 50/50 VUs, 27414 complete and 0 interrupted iterations
query_mix   [  64% ] 50 VUs  1m55.1s/3m0s

running (2m12.0s), 50/50 VUs, 27654 complete and 0 interrupted iterations
query_mix   [  64% ] 50 VUs  1m56.1s/3m0s

running (2m13.0s), 50/50 VUs, 27893 complete and 0 interrupted iterations
query_mix   [  65% ] 50 VUs  1m57.1s/3m0s

running (2m14.0s), 50/50 VUs, 28122 complete and 0 interrupted iterations
query_mix   [  66% ] 50 VUs  1m58.1s/3m0s

running (2m15.0s), 50/50 VUs, 28367 complete and 0 interrupted iterations
query_mix   [  66% ] 50 VUs  1m59.1s/3m0s

running (2m16.0s), 50/50 VUs, 28607 complete and 0 interrupted iterations
query_mix   [  67% ] 50 VUs  2m00.1s/3m0s

running (2m17.0s), 50/50 VUs, 28848 complete and 0 interrupted iterations
query_mix   [  67% ] 50 VUs  2m01.1s/3m0s

running (2m18.0s), 50/50 VUs, 29088 complete and 0 interrupted iterations
query_mix   [  68% ] 50 VUs  2m02.1s/3m0s

running (2m19.0s), 50/50 VUs, 29329 complete and 0 interrupted iterations
query_mix   [  68% ] 50 VUs  2m03.1s/3m0s

running (2m20.0s), 50/50 VUs, 29569 complete and 0 interrupted iterations
query_mix   [  69% ] 50 VUs  2m04.1s/3m0s

running (2m21.0s), 50/50 VUs, 29813 complete and 0 interrupted iterations
query_mix   [  69% ] 50 VUs  2m05.1s/3m0s

running (2m22.0s), 50/50 VUs, 30052 complete and 0 interrupted iterations
query_mix   [  70% ] 50 VUs  2m06.1s/3m0s

running (2m23.0s), 50/50 VUs, 30287 complete and 0 interrupted iterations
query_mix   [  71% ] 50 VUs  2m07.1s/3m0s

running (2m24.0s), 50/50 VUs, 30527 complete and 0 interrupted iterations
query_mix   [  71% ] 50 VUs  2m08.1s/3m0s

running (2m25.0s), 50/50 VUs, 30772 complete and 0 interrupted iterations
query_mix   [  72% ] 50 VUs  2m09.1s/3m0s

running (2m26.0s), 50/50 VUs, 31015 complete and 0 interrupted iterations
query_mix   [  72% ] 50 VUs  2m10.1s/3m0s

running (2m27.0s), 50/50 VUs, 31256 complete and 0 interrupted iterations
query_mix   [  73% ] 50 VUs  2m11.1s/3m0s

running (2m28.0s), 50/50 VUs, 31492 complete and 0 interrupted iterations
query_mix   [  73% ] 50 VUs  2m12.1s/3m0s

running (2m29.0s), 50/50 VUs, 31734 complete and 0 interrupted iterations
query_mix   [  74% ] 50 VUs  2m13.1s/3m0s

running (2m30.0s), 50/50 VUs, 31972 complete and 0 interrupted iterations
query_mix   [  74% ] 50 VUs  2m14.1s/3m0s

running (2m31.0s), 50/50 VUs, 32161 complete and 0 interrupted iterations
query_mix   [  75% ] 50 VUs  2m15.1s/3m0s

running (2m32.0s), 50/50 VUs, 32325 complete and 0 interrupted iterations
query_mix   [  76% ] 50 VUs  2m16.1s/3m0s

running (2m33.0s), 50/50 VUs, 32506 complete and 0 interrupted iterations
query_mix   [  76% ] 50 VUs  2m17.1s/3m0s

running (2m34.0s), 50/50 VUs, 32694 complete and 0 interrupted iterations
query_mix   [  77% ] 50 VUs  2m18.1s/3m0s

running (2m35.0s), 50/50 VUs, 32875 complete and 0 interrupted iterations
query_mix   [  77% ] 50 VUs  2m19.1s/3m0s

running (2m36.0s), 50/50 VUs, 33036 complete and 0 interrupted iterations
query_mix   [  78% ] 50 VUs  2m20.1s/3m0s

running (2m37.0s), 50/50 VUs, 33222 complete and 0 interrupted iterations
query_mix   [  78% ] 50 VUs  2m21.1s/3m0s

running (2m38.0s), 50/50 VUs, 33408 complete and 0 interrupted iterations
query_mix   [  79% ] 50 VUs  2m22.1s/3m0s

running (2m39.0s), 50/50 VUs, 33593 complete and 0 interrupted iterations
query_mix   [  79% ] 50 VUs  2m23.1s/3m0s

running (2m40.0s), 50/50 VUs, 33751 complete and 0 interrupted iterations
query_mix   [  80% ] 50 VUs  2m24.1s/3m0s

running (2m41.0s), 50/50 VUs, 33933 complete and 0 interrupted iterations
query_mix   [  81% ] 50 VUs  2m25.1s/3m0s

running (2m42.0s), 50/50 VUs, 34114 complete and 0 interrupted iterations
query_mix   [  81% ] 50 VUs  2m26.1s/3m0s

running (2m43.0s), 50/50 VUs, 34301 complete and 0 interrupted iterations
query_mix   [  82% ] 50 VUs  2m27.1s/3m0s

running (2m44.0s), 50/50 VUs, 34465 complete and 0 interrupted iterations
query_mix   [  82% ] 50 VUs  2m28.1s/3m0s

running (2m45.0s), 50/50 VUs, 34650 complete and 0 interrupted iterations
query_mix   [  83% ] 50 VUs  2m29.1s/3m0s

running (2m46.0s), 50/50 VUs, 34831 complete and 0 interrupted iterations
query_mix   [  83% ] 50 VUs  2m30.1s/3m0s

running (2m47.0s), 50/50 VUs, 34990 complete and 0 interrupted iterations
query_mix   [  84% ] 50 VUs  2m31.1s/3m0s

running (2m48.0s), 50/50 VUs, 35174 complete and 0 interrupted iterations
query_mix   [  84% ] 50 VUs  2m32.1s/3m0s

running (2m49.0s), 50/50 VUs, 35357 complete and 0 interrupted iterations
query_mix   [  85% ] 50 VUs  2m33.1s/3m0s

running (2m50.0s), 50/50 VUs, 35545 complete and 0 interrupted iterations
query_mix   [  86% ] 50 VUs  2m34.1s/3m0s

running (2m51.0s), 50/50 VUs, 35712 complete and 0 interrupted iterations
query_mix   [  86% ] 50 VUs  2m35.1s/3m0s

running (2m52.0s), 50/50 VUs, 35892 complete and 0 interrupted iterations
query_mix   [  87% ] 50 VUs  2m36.1s/3m0s

running (2m53.0s), 50/50 VUs, 36076 complete and 0 interrupted iterations
query_mix   [  87% ] 50 VUs  2m37.1s/3m0s

running (2m54.0s), 50/50 VUs, 36258 complete and 0 interrupted iterations
query_mix   [  88% ] 50 VUs  2m38.1s/3m0s

running (2m55.0s), 50/50 VUs, 36423 complete and 0 interrupted iterations
query_mix   [  88% ] 50 VUs  2m39.1s/3m0s

running (2m56.0s), 50/50 VUs, 36607 complete and 0 interrupted iterations
query_mix   [  89% ] 50 VUs  2m40.1s/3m0s

running (2m57.0s), 50/50 VUs, 36784 complete and 0 interrupted iterations
query_mix   [  89% ] 50 VUs  2m41.1s/3m0s

running (2m58.0s), 50/50 VUs, 36947 complete and 0 interrupted iterations
query_mix   [  90% ] 50 VUs  2m42.1s/3m0s

running (2m59.0s), 50/50 VUs, 37128 complete and 0 interrupted iterations
query_mix   [  91% ] 50 VUs  2m43.1s/3m0s

running (3m00.0s), 50/50 VUs, 37311 complete and 0 interrupted iterations
query_mix   [  91% ] 50 VUs  2m44.1s/3m0s

running (3m01.0s), 50/50 VUs, 37476 complete and 0 interrupted iterations
query_mix   [  92% ] 50 VUs  2m45.1s/3m0s

running (3m02.0s), 50/50 VUs, 37654 complete and 0 interrupted iterations
query_mix   [  92% ] 50 VUs  2m46.1s/3m0s

running (3m03.0s), 50/50 VUs, 37841 complete and 0 interrupted iterations
query_mix   [  93% ] 50 VUs  2m47.1s/3m0s

running (3m04.0s), 50/50 VUs, 38024 complete and 0 interrupted iterations
query_mix   [  93% ] 50 VUs  2m48.1s/3m0s

running (3m05.0s), 50/50 VUs, 38189 complete and 0 interrupted iterations
query_mix   [  94% ] 50 VUs  2m49.1s/3m0s

running (3m06.0s), 50/50 VUs, 38372 complete and 0 interrupted iterations
query_mix   [  94% ] 50 VUs  2m50.1s/3m0s

running (3m07.0s), 50/50 VUs, 38557 complete and 0 interrupted iterations
query_mix   [  95% ] 50 VUs  2m51.1s/3m0s

running (3m08.0s), 50/50 VUs, 38736 complete and 0 interrupted iterations
query_mix   [  96% ] 50 VUs  2m52.1s/3m0s

running (3m09.0s), 50/50 VUs, 38891 complete and 0 interrupted iterations
query_mix   [  96% ] 50 VUs  2m53.1s/3m0s

running (3m10.0s), 50/50 VUs, 39079 complete and 0 interrupted iterations
query_mix   [  97% ] 50 VUs  2m54.1s/3m0s

running (3m11.0s), 50/50 VUs, 39255 complete and 0 interrupted iterations
query_mix   [  97% ] 50 VUs  2m55.1s/3m0s

running (3m12.0s), 50/50 VUs, 39420 complete and 0 interrupted iterations
query_mix   [  98% ] 50 VUs  2m56.1s/3m0s

running (3m13.0s), 50/50 VUs, 39602 complete and 0 interrupted iterations
query_mix   [  98% ] 50 VUs  2m57.1s/3m0s

running (3m14.0s), 50/50 VUs, 39781 complete and 0 interrupted iterations
query_mix   [  99% ] 50 VUs  2m58.1s/3m0s

running (3m15.0s), 50/50 VUs, 39951 complete and 0 interrupted iterations
query_mix   [  99% ] 50 VUs  2m59.1s/3m0s

running (3m16.0s), 45/50 VUs, 40131 complete and 0 interrupted iterations
query_mix ↓ [ 100% ] 50 VUs  3m0s


  █ THRESHOLDS 

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%


  █ TOTAL RESULTS 

    checks_total.......: 40176   204.721526/s
    checks_succeeded...: 100.00% 40176 out of 40176
    checks_failed......: 0.00%   0 out of 40176

    ✓ status is 200

    CUSTOM
    query_duration_ms..............: avg=23.54ms  min=4.19ms   med=7.05ms   max=561.57ms p(90)=15.16ms  p(95)=149.59ms

    HTTP
    http_req_duration..............: avg=23.9ms   min=4.19ms   med=7.06ms   max=561.57ms p(90)=15.31ms  p(95)=163.65ms
      { expected_response:true }...: avg=23.9ms   min=4.19ms   med=7.06ms   max=561.57ms p(90)=15.31ms  p(95)=163.65ms
    http_req_failed................: 0.00% 0 out of 40236
    http_reqs......................: 40236 205.027263/s

    EXECUTION
    iteration_duration.............: avg=224.24ms min=204.57ms med=207.78ms max=763.57ms p(90)=215.87ms p(95)=350.28ms
    iterations.....................: 40176 204.721526/s
    vus............................: 45    min=0          max=50
    vus_max........................: 50    min=50         max=50

    NETWORK
    data_received..................: 17 MB 89 kB/s
    data_sent......................: 22 MB 112 kB/s



running (3m16.2s), 00/50 VUs, 40176 complete and 0 interrupted iterations
query_mix ✓ [ 100% ] 50 VUs  3m0s